backend/load-test.yml
config:
  target: "https://backendpraca.onrender.com"
  phases:
    - duration: 60  # Test trwa 60 sekund
      arrivalRate: 5  # 5 użytkowników na sekundę (300 req/min – ale rozłożone)
  defaults:
    headers:
      Authorization: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY3YmMxNWE2NzliNzhlMWQ0NjliMTA0MyIsImVtYWlsIjoibWFyY2VsLmZpbG9zZWtAd3AucGwiLCJpYXQiOjE3NDAzNzk2MjMsImV4cCI6MTc0MDQ2NjAyM30.qXujFFnziybTf9pD6BOSWyWmJFUS2rRMhoY0uflOJbw"  # Jeśli API wymaga tokena

scenarios:
  - flow:
      - get:
          url: "/api/users/goals"  # Pobieranie celów użytkownika
      - get:
          url: "/api/meals"  # Pobieranie posiłków
      - post:
          url: "/api/meals"
          json:
            name: "Testowy Posiłek"
            calories: 500
            protein: 30
            carbs: 50
            fats: 10
      - think: 2  # Pauza 2 sekundy między kolejnymi akcjami użytkownika